k6/results/mixed-1m-2api.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/mixed.js
        output: -

     scenarios: (100.00%) 3 scenarios, 5000 max VUs, 1m0s max duration (incl. graceful stop):
              * rank: 5000.00 iterations/s for 30s (maxVUs: 300-2000, exec: rank, gracefulStop: 30s)
              * top: 5000.00 iterations/s for 30s (maxVUs: 300-2000, exec: top, gracefulStop: 30s)
              * write: 1000.00 iterations/s for 30s (maxVUs: 200-1000, exec: write, gracefulStop: 30s)


running (0m01.0s), 0020/0871 VUs, 10032 complete and 0 interrupted iterations
rank    [   3% ] 0008/0339 VUs  01.0s/30s  5000.00 iters/s
top     [   3% ] 0009/0332 VUs  01.0s/30s  5000.00 iters/s
write   [   3% ] 0003/0200 VUs  01.0s/30s  1000.00 iters/s

running (0m02.0s), 0025/0871 VUs, 21028 complete and 0 interrupted iterations
rank    [   7% ] 0012/0339 VUs  02.0s/30s  5000.00 iters/s
top     [   7% ] 0011/0332 VUs  02.0s/30s  5000.00 iters/s
write   [   7% ] 0002/0200 VUs  02.0s/30s  1000.00 iters/s

running (0m03.0s), 0017/0871 VUs, 32040 complete and 0 interrupted iterations
rank    [  10% ] 0005/0339 VUs  03.0s/30s  5000.00 iters/s
top     [  10% ] 0008/0332 VUs  03.0s/30s  5000.00 iters/s
write   [  10% ] 0002/0200 VUs  03.0s/30s  1000.00 iters/s

running (0m04.0s), 0041/0871 VUs, 43011 complete and 0 interrupted iterations
rank    [  13% ] 0018/0339 VUs  04.0s/30s  5000.00 iters/s
top     [  13% ] 0019/0332 VUs  04.0s/30s  5000.00 iters/s
write   [  13% ] 0003/0200 VUs  04.0s/30s  1000.00 iters/s

running (0m05.0s), 0020/0871 VUs, 54031 complete and 0 interrupted iterations
rank    [  17% ] 0009/0339 VUs  05.0s/30s  5000.00 iters/s
top     [  17% ] 0010/0332 VUs  05.0s/30s  5000.00 iters/s
write   [  17% ] 0002/0200 VUs  05.0s/30s  1000.00 iters/s

running (0m06.0s), 0020/0871 VUs, 65033 complete and 0 interrupted iterations
rank    [  20% ] 0006/0339 VUs  06.0s/30s  5000.00 iters/s
top     [  20% ] 0007/0332 VUs  06.0s/30s  5000.00 iters/s
write   [  20% ] 0002/0200 VUs  06.0s/30s  1000.00 iters/s

running (0m07.0s), 0018/0871 VUs, 76033 complete and 0 interrupted iterations
rank    [  23% ] 0007/0339 VUs  07.0s/30s  5000.00 iters/s
top     [  23% ] 0009/0332 VUs  07.0s/30s  5000.00 iters/s
write   [  23% ] 0002/0200 VUs  07.0s/30s  1000.00 iters/s

running (0m08.0s), 0017/0871 VUs, 87031 complete and 0 interrupted iterations
rank    [  27% ] 0008/0339 VUs  08.0s/30s  5000.00 iters/s
top     [  27% ] 0008/0332 VUs  08.0s/30s  5000.00 iters/s
write   [  27% ] 0002/0200 VUs  08.0s/30s  1000.00 iters/s

running (0m09.0s), 0046/0871 VUs, 98009 complete and 0 interrupted iterations
rank    [  30% ] 0021/0339 VUs  09.0s/30s  5000.00 iters/s
top     [  30% ] 0021/0332 VUs  09.0s/30s  5000.00 iters/s
write   [  30% ] 0004/0200 VUs  09.0s/30s  1000.00 iters/s

running (0m10.0s), 0017/0871 VUs, 109036 complete and 0 interrupted iterations
rank    [  33% ] 0007/0339 VUs  10.0s/30s  5000.00 iters/s
top     [  33% ] 0007/0332 VUs  10.0s/30s  5000.00 iters/s
write   [  33% ] 0003/0200 VUs  10.0s/30s  1000.00 iters/s

running (0m11.0s), 0020/0871 VUs, 120031 complete and 0 interrupted iterations
rank    [  37% ] 0008/0339 VUs  11.0s/30s  5000.00 iters/s
top     [  37% ] 0012/0332 VUs  11.0s/30s  5000.00 iters/s
write   [  37% ] 0002/0200 VUs  11.0s/30s  1000.00 iters/s

running (0m12.0s), 0022/0871 VUs, 131057 complete and 0 interrupted iterations
rank    [  40% ] 0002/0339 VUs  12.0s/30s  5000.00 iters/s
top     [  40% ] 0016/0332 VUs  12.0s/30s  5000.00 iters/s
write   [  40% ] 0004/0200 VUs  12.0s/30s  1000.00 iters/s

running (0m13.0s), 0014/0871 VUs, 142037 complete and 0 interrupted iterations
rank    [  43% ] 0007/0339 VUs  13.0s/30s  5000.00 iters/s
top     [  43% ] 0007/0332 VUs  13.0s/30s  5000.00 iters/s
write   [  43% ] 0002/0200 VUs  13.0s/30s  1000.00 iters/s

running (0m14.0s), 0010/0871 VUs, 153036 complete and 0 interrupted iterations
rank    [  47% ] 0004/0339 VUs  14.0s/30s  5000.00 iters/s
top     [  47% ] 0003/0332 VUs  14.0s/30s  5000.00 iters/s
write   [  47% ] 0002/0200 VUs  14.0s/30s  1000.00 iters/s

running (0m15.0s), 0017/0871 VUs, 164037 complete and 0 interrupted iterations
rank    [  50% ] 0008/0339 VUs  15.0s/30s  5000.00 iters/s
top     [  50% ] 0008/0332 VUs  15.0s/30s  5000.00 iters/s
write   [  50% ] 0001/0200 VUs  15.0s/30s  1000.00 iters/s

running (0m16.0s), 0016/0871 VUs, 175031 complete and 0 interrupted iterations
rank    [  53% ] 0007/0339 VUs  16.0s/30s  5000.00 iters/s
top     [  53% ] 0007/0332 VUs  16.0s/30s  5000.00 iters/s
write   [  53% ] 0002/0200 VUs  16.0s/30s  1000.00 iters/s

running (0m17.0s), 0018/0871 VUs, 186044 complete and 0 interrupted iterations
rank    [  57% ] 0007/0339 VUs  17.0s/30s  5000.00 iters/s
top     [  57% ] 0009/0332 VUs  17.0s/30s  5000.00 iters/s
write   [  57% ] 0002/0200 VUs  17.0s/30s  1000.00 iters/s

running (0m18.0s), 0026/0871 VUs, 197027 complete and 0 interrupted iterations
rank    [  60% ] 0011/0339 VUs  18.0s/30s  5000.00 iters/s
top     [  60% ] 0010/0332 VUs  18.0s/30s  5000.00 iters/s
write   [  60% ] 0003/0200 VUs  18.0s/30s  1000.00 iters/s

running (0m19.0s), 0030/0871 VUs, 208017 complete and 0 interrupted iterations
rank    [  63% ] 0015/0339 VUs  19.0s/30s  5000.00 iters/s
top     [  63% ] 0012/0332 VUs  19.0s/30s  5000.00 iters/s
write   [  63% ] 0004/0200 VUs  19.0s/30s  1000.00 iters/s

running (0m20.0s), 0038/0871 VUs, 219018 complete and 0 interrupted iterations
rank    [  67% ] 0020/0339 VUs  20.0s/30s  5000.00 iters/s
top     [  67% ] 0015/0332 VUs  20.0s/30s  5000.00 iters/s
write   [  67% ] 0005/0200 VUs  20.0s/30s  1000.00 iters/s

running (0m21.0s), 0010/0871 VUs, 230034 complete and 0 interrupted iterations
rank    [  70% ] 0005/0339 VUs  21.0s/30s  5000.00 iters/s
top     [  70% ] 0006/0332 VUs  21.0s/30s  5000.00 iters/s
write   [  70% ] 0001/0200 VUs  21.0s/30s  1000.00 iters/s

running (0m22.0s), 0016/0871 VUs, 241036 complete and 0 interrupted iterations
rank    [  73% ] 0008/0339 VUs  22.0s/30s  5000.00 iters/s
top     [  73% ] 0007/0332 VUs  22.0s/30s  5000.00 iters/s
write   [  73% ] 0002/0200 VUs  22.0s/30s  1000.00 iters/s

running (0m23.0s), 0036/0871 VUs, 252033 complete and 0 interrupted iterations
rank    [  77% ] 0017/0339 VUs  23.0s/30s  5000.00 iters/s
top     [  77% ] 0019/0332 VUs  23.0s/30s  5000.00 iters/s
write   [  77% ] 0004/0200 VUs  23.0s/30s  1000.00 iters/s

running (0m24.0s), 0012/0871 VUs, 263035 complete and 0 interrupted iterations
rank    [  80% ] 0003/0339 VUs  24.0s/30s  5000.00 iters/s
top     [  80% ] 0007/0332 VUs  24.0s/30s  5000.00 iters/s
write   [  80% ] 0001/0200 VUs  24.0s/30s  1000.00 iters/s

running (0m25.0s), 0017/0871 VUs, 274026 complete and 0 interrupted iterations
rank    [  83% ] 0006/0339 VUs  25.0s/30s  5000.00 iters/s
top     [  83% ] 0011/0332 VUs  25.0s/30s  5000.00 iters/s
write   [  83% ] 0002/0200 VUs  25.0s/30s  1000.00 iters/s

running (0m26.0s), 0023/0871 VUs, 285030 complete and 0 interrupted iterations
rank    [  87% ] 0010/0339 VUs  26.0s/30s  5000.00 iters/s
top     [  87% ] 0010/0332 VUs  26.0s/30s  5000.00 iters/s
write   [  87% ] 0002/0200 VUs  26.0s/30s  1000.00 iters/s

running (0m27.0s), 0018/0871 VUs, 296042 complete and 0 interrupted iterations
rank    [  90% ] 0007/0339 VUs  27.0s/30s  5000.00 iters/s
top     [  90% ] 0008/0332 VUs  27.0s/30s  5000.00 iters/s
write   [  90% ] 0003/0200 VUs  27.0s/30s  1000.00 iters/s

running (0m28.0s), 0030/0871 VUs, 307022 complete and 0 interrupted iterations
rank    [  93% ] 0014/0339 VUs  28.0s/30s  5000.00 iters/s
top     [  93% ] 0013/0332 VUs  28.0s/30s  5000.00 iters/s
write   [  93% ] 0004/0200 VUs  28.0s/30s  1000.00 iters/s

running (0m29.0s), 0011/0871 VUs, 318041 complete and 0 interrupted iterations
rank    [  97% ] 0006/0339 VUs  29.0s/30s  5000.00 iters/s
top     [  97% ] 0006/0332 VUs  29.0s/30s  5000.00 iters/s
write   [  97% ] 0002/0200 VUs  29.0s/30s  1000.00 iters/s

running (0m30.0s), 0021/0871 VUs, 329032 complete and 0 interrupted iterations
rank    [ 100% ] 0009/0339 VUs  30.0s/30s  5000.00 iters/s
top     [ 100% ] 0009/0332 VUs  30.0s/30s  5000.00 iters/s
write   [ 100% ] 0003/0200 VUs  30.0s/30s  1000.00 iters/s

     ✓ rank 200/404
     ✓ top 200
     ✓ score 200

     checks.............................: 100.00% 329550 out of 329550
     data_received......................: 925 MB  31 MB/s
     data_sent..........................: 41 MB   1.4 MB/s
     dropped_iterations.................: 455     15.165081/s
     http_req_blocked...................: avg=87.28µs med=1.58µs p(95)=4.54µs  p(99)=25.02µs  max=86.72ms 
     http_req_connecting................: avg=82.76µs med=0s     p(95)=0s      p(99)=0s       max=66.4ms  
   ✓ http_req_duration..................: avg=2.38ms  med=1.66ms p(95)=4.92ms  p(99)=14.27ms  max=173.85ms
       { expected_response:true }.......: avg=2.38ms  med=1.66ms p(95)=4.92ms  p(99)=14.27ms  max=173.85ms
     ✓ { name:GET /leaderboard/rank }...: avg=2.29ms  med=1.63ms p(95)=4.84ms  p(99)=13.82ms  max=92.54ms 
     ✓ { name:GET /leaderboard/top }....: avg=2.29ms  med=1.61ms p(95)=4.77ms  p(99)=13.93ms  max=91.5ms  
     ✓ { name:POST /score }.............: avg=3.22ms  med=2.05ms p(95)=5.84ms  p(99)=20.83ms  max=173.85ms
   ✓ http_req_failed....................: 0.00%   0 out of 329550
     http_req_receiving.................: avg=18.74µs med=9.87µs p(95)=56.66µs p(99)=121.02µs max=15.02ms 
     http_req_sending...................: avg=13.99µs med=3.33µs p(95)=44.29µs p(99)=151.1µs  max=15.71ms 
     http_req_tls_handshaking...........: avg=0s      med=0s     p(95)=0s      p(99)=0s       max=0s      
     http_req_waiting...................: avg=2.34ms  med=1.63ms p(95)=4.86ms  p(99)=14.07ms  max=173.77ms
     http_reqs..........................: 329550  10983.851867/s
     iteration_duration.................: avg=2.51ms  med=1.71ms p(95)=5.01ms  p(99)=14.58ms  max=194.82ms
     iterations.........................: 329550  10983.851867/s
     vus................................: 18      min=4                max=39 
     vus_max............................: 871     min=871              max=871


running (0m30.0s), 0000/0871 VUs, 329550 complete and 0 interrupted iterations
rank  ✓ [ 100% ] 0000/0339 VUs  30s  5000.00 iters/s
top   ✓ [ 100% ] 0000/0332 VUs  30s  5000.00 iters/s
write ✓ [ 100% ] 0000/0200 VUs  30s  1000.00 iters/s